In [221]:
import numpy as np
import pandas as pd

In [222]:
mydataset = {
  'cars': ["BMW", "Volvo", "Ford"],
  'passings': [3, 7, 2]
}

myvar = pd.DataFrame(mydataset)

print(myvar)

    cars  passings
0    BMW         3
1  Volvo         7
2   Ford         2

In [223]:
x=np.array([1,2,3,4,5])
y=np.array([2,4,6,8,10])
myv= pd.DataFrame({'xx':x,'yy':y})
print(myv)

   xx  yy
0   1   2
1   2   4
2   3   6
3   4   8
4   5  10

In [224]:
a = [1, 7, 2]

myvar1 = pd.Series(a)

print(myvar1)

0    1
1    7
2    2
dtype: int64

In [225]:
a = [1, 7, 2]
myvar = pd.Series(a, index = ["x", "y", "z"])
print(myvar)

x    1
y    7
z    2
dtype: int64

In [226]:
s=np.array([1,2,3,4,5,6,7,8,9,10])
my=pd.Series({"s":s})
print(my)

s    [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
dtype: object

In [227]:
s=np.array([3,6,9,12,15,18,21,24,27,30])
s1=np.array([2,4,6,8,10,12,14,16,18,20])
my=pd.DataFrame({"s1":s1,"s":s})
print(my)

   s1   s
0   2   3
1   4   6
2   6   9
3   8  12
4  10  15
5  12  18
6  14  21
7  16  24
8  18  27
9  20  30

In [228]:
info={
    "name": ["John", "Mary", "Peter", "Jeff", "Bill", "Lisa", "Joseph"],
    "age": [23, 78, 22, 19, 45, 33, 20],
    "city": ["London", "New York", "London", "Paris", "London", "New York", "London"],
    "marks": [60, 90, 70, 50, 87, 79, 90]
}
infosub=pd.DataFrame(info)
infosub

     name  age      city  marks
0    John   23    London     60
1    Mary   78  New York     90
2   Peter   22    London     70
3    Jeff   19     Paris     50
4    Bill   45    London     87
5    Lisa   33  New York     79
6  Joseph   20    London     90

In [229]:
infosub.to_csv('infosub.csv', index=False)

In [230]:
infosub.head(3)

    name  age      city  marks
0   John   23    London     60
1   Mary   78  New York     90
2  Peter   22    London     70

In [231]:
infosub.tail(4)

     name  age      city  marks
3    Jeff   19     Paris     50
4    Bill   45    London     87
5    Lisa   33  New York     79
6  Joseph   20    London     90

In [232]:
infosub.sample(4)

   name  age      city  marks
5  Lisa   33  New York     79
0  John   23    London     60
3  Jeff   19     Paris     50
1  Mary   78  New York     90

In [233]:
infosub.describe()

             age      marks
count   7.000000   7.000000
mean   34.285714  75.142857
std    21.383126  15.731376
min    19.000000  50.000000
25%    21.000000  65.000000
50%    23.000000  79.000000
75%    39.000000  88.500000
max    78.000000  90.000000

In [234]:
infosub[['marks','city']]

   marks      city
0     60    London
1     90  New York
2     70    London
3     50     Paris
4     87    London
5     79  New York
6     90    London

In [235]:
infosub['marks'][0]=100

C:\Users\Utkarsh\AppData\Local\Temp\ipykernel_10868\894755050.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  infosub['marks'][0]=100

In [236]:
infosub

     name  age      city  marks
0    John   23    London    100
1    Mary   78  New York     90
2   Peter   22    London     70
3    Jeff   19     Paris     50
4    Bill   45    London     87
5    Lisa   33  New York     79
6  Joseph   20    London     90

In [237]:
a=np.random.randint(1,100,10)
a

array([71, 51, 29, 81, 10, 74, 71, 80, 43, 73])

In [238]:
newdf=pd.DataFrame(np.random.randn(100,4), index=np.arange(1,101))

In [239]:
newdf

            0         1         2         3
1    0.731974 -0.500743  1.002868  2.218058
2    1.118534  0.665030 -1.930173 -1.668101
3    0.619932 -0.872762  0.240765  1.120057
4   -0.148300 -1.442579 -0.475558 -0.061796
5    0.263515 -0.919680 -0.480944  1.107945
..        ...       ...       ...       ...
96  -0.819255 -0.425149  1.046146 -0.112362
97   1.270265 -1.080075  0.094272  0.103875
98  -0.416436 -0.362099  0.653106 -0.427839
99   0.789609  1.350755  0.078974  1.185199
100 -0.449594 -0.173739  0.469114  0.104016

[100 rows x 4 columns]

In [240]:
infosub['name'][0]='myname'

C:\Users\Utkarsh\AppData\Local\Temp\ipykernel_10868\114682953.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  infosub['name'][0]='myname'

In [241]:
infosub

     name  age      city  marks
0  myname   23    London    100
1    Mary   78  New York     90
2   Peter   22    London     70
3    Jeff   19     Paris     50
4    Bill   45    London     87
5    Lisa   33  New York     79
6  Joseph   20    London     90

In [242]:
infosub.index

RangeIndex(start=0, stop=7, step=1)

In [243]:
# infosub.loc['name',0]='anthony'
# infosub.loc['name',1]='aman'

In [244]:
infosub.loc[0,'name']='a'
infosub.loc[0,'age']='b'
infosub

     name age      city  marks
0       a   b    London    100
1    Mary  78  New York     90
2   Peter  22    London     70
3    Jeff  19     Paris     50
4    Bill  45    London     87
5    Lisa  33  New York     79
6  Joseph  20    London     90

In [245]:
infosub.drop('marks', axis=1)

     name age      city
0       a   b    London
1    Mary  78  New York
2   Peter  22    London
3    Jeff  19     Paris
4    Bill  45    London
5    Lisa  33  New York
6  Joseph  20    London

In [246]:
infosub.iloc[1:6][1:4]

    name age    city  marks
2  Peter  22  London     70
3   Jeff  19   Paris     50
4   Bill  45  London     87

In [247]:
x=np.array([1,2,3,4,5])
y=np.array([5,10,15,20,25])
vyvar=pd.DataFrame({"x":x,"y":y})
print(vyvar)
vyvar['x'].sum(axis=0)

   x   y
0  1   5
1  2  10
2  3  15
3  4  20
4  5  25

15

In [248]:
vyvar1=pd.Series(x)
vyvar1

0    1
1    2
2    3
3    4
4    5
dtype: int32

In [249]:
name=['aman','rocky','ram','ayush']
age=[10,20,30,40]
city=['goa','delhi','lko','mumbai']
vb=pd.DataFrame({"name":name,"age":age,"city":city}, index=np.arange(1,5))
vb

    name  age    city
1   aman   10     goa
2  rocky   20   delhi
3    ram   30     lko
4  ayush   40  mumbai

In [250]:
vb['city'].nunique()

4

In [251]:
vb['city'].describe()

count       4
unique      4
top       goa
freq        1
Name: city, dtype: object

In [252]:
vb['city'].duplicated()

1    False
2    False
3    False
4    False
Name: city, dtype: bool

In [253]:
ad=vb['age'].sum(axis=0)
ad

100

In [254]:
file='Canada.xlsx'
pd.set_option('display.max_columns',None)
canada=pd.read_excel(file,sheet_name=1,skiprows=20,skipfooter=2)

In [255]:
pd.set_option('display.max_columns',None)

In [256]:
file='Canada.xlsx'
canada=pd.read_excel(file, sheet_name=1,skiprows=20,skipfooter=2)

In [257]:
canada['AreaName']  # Series  -only 1 column(1 Dimensional)

0         Asia
1       Europe
2       Africa
3      Oceania
4       Europe
        ...
190       Asia
191     Africa
192       Asia
193     Africa
194     Africa
Name: AreaName, Length: 195, dtype: object

In [258]:
canda

NameError: name 'canda' is not defined

In [ ]:
canada

,Type,Coverage,OdName,AREA,AreaName,REG,RegName,DEV,DevName,1980,1981,1982,1983,1984,1985,1986,1987,1988,1989,1990,1991,1992,1993,1994,1995,1996,1997,1998,1999,2000,2001,2002,2003,2004,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,Immigrants,Foreigners,Afghanistan,935,Asia,5501,Southern Asia,902,Developing regions,16,39,39,47,71,340,496,741,828,1076,1028,1378,1170,713,858,1537,2212,2555,1999,2395,3326,4067,3697,3479,2978,3436,3009,2652,2111,1746,1758,2203,2635,2004
1,Immigrants,Foreigners,Albania,908,Europe,925,Southern Europe,901,Developed regions,1,0,0,0,0,0,1,2,2,3,3,21,56,96,71,63,113,307,574,1264,1816,1602,1021,853,1450,1223,856,702,560,716,561,539,620,603
2,Immigrants,Foreigners,Algeria,903,Africa,912,Northern Africa,902,Developing regions,80,67,71,69,63,44,69,132,242,434,491,872,795,717,595,1106,2054,1842,2292,2389,2867,3418,3406,3072,3616,3626,4807,3623,4005,5393,4752,4325,3774,4331
3,Immigrants,Foreigners,American Samoa,909,Oceania,957,Polynesia,902,Developing regions,0,1,0,0,0,0,0,1,0,1,2,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0
4,Immigrants,Foreigners,Andorra,908,Europe,925,Southern Europe,901,Developed regions,0,0,0,0,0,0,2,0,0,0,3,0,1,0,0,0,0,0,2,0,0,1,0,2,0,0,1,1,0,0,0,0,1,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
190,Immigrants,Foreigners,Viet Nam,935,Asia,920,South-Eastern Asia,902,Developing regions,1191,1829,2162,3404,7583,5907,2741,1406,1411,3004,3801,5870,5416,6547,5105,3723,2462,1752,1631,1419,1803,2117,2291,1713,1816,1852,3153,2574,1784,2171,1942,1723,1731,2112
191,Immigrants,Foreigners,Western Sahara,903,Africa,912,Northern Africa,902,Developing regions,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0
192,Immigrants,Foreigners,Yemen,935,Asia,922,Western Asia,902,Developing regions,1,2,1,6,0,18,7,12,7,18,4,18,41,41,39,73,144,121,141,134,122,181,171,113,124,161,140,122,133,128,211,160,174,217
193,Immigrants,Foreigners,Zambia,903,Africa,910,Eastern Africa,902,Developing regions,11,17,11,7,16,9,15,23,44,68,77,69,73,46,51,41,34,72,34,51,39,78,50,46,56,91,77,71,64,60,102,69,46,59
194,Immigrants,Foreigners,Zimbabwe,903,Africa,910,Eastern Africa,902,Developing regions,72,114,102,44,32,29,43,68,99,187,129,94,61,72,78,58,39,44,43,49,98,110,191,669,1450,615,454,663,611,508,494,434,437,407

In [ ]:
ad=canada[1980].sum(axis=0)
ad

99137

In [ ]:
canada[['OdName', 'AreaName', 'RegName', 'DevName']].head(20)

,OdName,AreaName,RegName,DevName
0,Afghanistan,Asia,Southern Asia,Developing regions
1,Albania,Europe,Southern Europe,Developed regions
2,Algeria,Africa,Northern Africa,Developing regions
3,American Samoa,Oceania,Polynesia,Developing regions
4,Andorra,Europe,Southern Europe,Developed regions
5,Angola,Africa,Middle Africa,Developing regions
6,Antigua and Barbuda,Latin America and the Caribbean,Caribbean,Developing regions
7,Argentina,Latin America and the Caribbean,South America,Developing regions
8,Armenia,Asia,Western Asia,Developing regions
9,Australia,Oceania,Australia and New Zealand,Developed regions
10,Austria,Europe,Western Europe,Developed regions
11,Azerbaijan,Asia,Western Asia,Developing regions
12,Bahamas,Latin America and the Caribbean,Caribbean,Developing regions
13,Bahrain,Asia,Western Asia,Developing regions
14,Bangladesh,Asia,Southern Asia,Developing regions
15,Barbados,Latin America and the Caribbean,Caribbean,Developing regions
16,Belarus,Europe,Eastern Europe,Developed regions
17,Belgium,Europe,Western Europe,Developed regions
18,Belize,Latin America and the Caribbean,Central America,Developing regions
19,Benin,Africa,Western Africa,Developing regions

In [260]:
canada['AreaName'].describe()

count        195
unique         6
top       Africa
freq          54
Name: AreaName, dtype: object

In [267]:
canada[10:18]

,Type,Coverage,OdName,AREA,AreaName,REG,RegName,DEV,DevName,1980,1981,1982,1983,1984,1985,1986,1987,1988,1989,1990,1991,1992,1993,1994,1995,1996,1997,1998,1999,2000,2001,2002,2003,2004,2005,2006,2007,2008,2009,2010,2011,2012,2013
10,Immigrants,Foreigners,Austria,908,Europe,926,Western Europe,901,Developed regions,234,238,201,117,127,165,196,265,198,227,158,189,131,132,133,153,191,152,190,117,97,134,87,113,118,122,102,98,91,109,124,84,102,90
11,Immigrants,Foreigners,Azerbaijan,935,Asia,922,Western Asia,902,Developing regions,0,0,0,0,0,0,0,0,0,0,0,0,0,17,18,23,26,38,62,54,77,98,186,167,230,359,236,203,125,165,209,138,161,57
12,Immigrants,Foreigners,Bahamas,904,Latin America and the Caribbean,915,Caribbean,902,Developing regions,26,23,38,12,21,28,23,18,22,32,18,29,16,20,21,17,30,17,14,13,14,20,17,14,13,14,18,23,30,27,25,40,60,55
13,Immigrants,Foreigners,Bahrain,935,Asia,922,Western Asia,902,Developing regions,0,2,1,1,1,3,0,2,10,9,6,9,9,11,14,10,17,28,14,27,34,13,17,15,12,12,12,22,9,35,28,21,39,32
14,Immigrants,Foreigners,Bangladesh,935,Asia,5501,Southern Asia,902,Developing regions,83,84,86,81,98,92,486,503,476,387,611,1115,1655,1280,1361,2042,2824,3378,2202,2064,3119,3831,2944,2137,2660,4171,4014,2897,2939,2104,4721,2694,2640,3789
15,Immigrants,Foreigners,Barbados,904,Latin America and the Caribbean,915,Caribbean,902,Developing regions,372,376,299,244,265,285,251,303,265,275,327,373,336,380,179,211,176,153,139,114,122,148,122,74,90,111,97,130,134,125,121,97,132,97
16,Immigrants,Foreigners,Belarus,908,Europe,923,Eastern Europe,901,Developed regions,0,0,0,0,0,0,0,0,0,0,0,0,12,40,114,118,156,349,540,426,515,430,435,435,543,558,439,568,524,454,438,357,277,247
17,Immigrants,Foreigners,Belgium,908,Europe,926,Western Europe,901,Developed regions,511,540,519,297,183,181,197,283,333,307,303,216,208,240,201,240,279,227,307,209,369,340,307,320,411,400,302,363,335,358,363,332,402,379

In [274]:
cols=list(range(1980,1991))
canada[cols[:6]]

     1980  1981  1982  1983  1984  1985
0      16    39    39    47    71   340
1       1     0     0     0     0     0
2      80    67    71    69    63    44
3       0     1     0     0     0     0
4       0     0     0     0     0     0
..    ...   ...   ...   ...   ...   ...
190  1191  1829  2162  3404  7583  5907
191     0     0     0     0     0     0
192     1     2     1     6     0    18
193    11    17    11     7    16     9
194    72   114   102    44    32    29

[195 rows x 6 columns]

In [275]:
canada.set_index('OdName')

,Type,Coverage,AREA,AreaName,REG,RegName,DEV,DevName,1980,1981,1982,1983,1984,1985,1986,1987,1988,1989,1990,1991,1992,1993,1994,1995,1996,1997,1998,1999,2000,2001,2002,2003,2004,2005,2006,2007,2008,2009,2010,2011,2012,2013
OdName,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,
Afghanistan,Immigrants,Foreigners,935,Asia,5501,Southern Asia,902,Developing regions,16,39,39,47,71,340,496,741,828,1076,1028,1378,1170,713,858,1537,2212,2555,1999,2395,3326,4067,3697,3479,2978,3436,3009,2652,2111,1746,1758,2203,2635,2004
Albania,Immigrants,Foreigners,908,Europe,925,Southern Europe,901,Developed regions,1,0,0,0,0,0,1,2,2,3,3,21,56,96,71,63,113,307,574,1264,1816,1602,1021,853,1450,1223,856,702,560,716,561,539,620,603
Algeria,Immigrants,Foreigners,903,Africa,912,Northern Africa,902,Developing regions,80,67,71,69,63,44,69,132,242,434,491,872,795,717,595,1106,2054,1842,2292,2389,2867,3418,3406,3072,3616,3626,4807,3623,4005,5393,4752,4325,3774,4331
American Samoa,Immigrants,Foreigners,909,Oceania,957,Polynesia,902,Developing regions,0,1,0,0,0,0,0,1,0,1,2,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0
Andorra,Immigrants,Foreigners,908,Europe,925,Southern Europe,901,Developed regions,0,0,0,0,0,0,2,0,0,0,3,0,1,0,0,0,0,0,2,0,0,1,0,2,0,0,1,1,0,0,0,0,1,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
Viet Nam,Immigrants,Foreigners,935,Asia,920,South-Eastern Asia,902,Developing regions,1191,1829,2162,3404,7583,5907,2741,1406,1411,3004,3801,5870,5416,6547,5105,3723,2462,1752,1631,1419,1803,2117,2291,1713,1816,1852,3153,2574,1784,2171,1942,1723,1731,2112
Western Sahara,Immigrants,Foreigners,903,Africa,912,Northern Africa,902,Developing regions,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0
Yemen,Immigrants,Foreigners,935,Asia,922,Western Asia,902,Developing regions,1,2,1,6,0,18,7,12,7,18,4,18,41,41,39,73,144,121,141,134,122,181,171,113,124,161,140,122,133,128,211,160,174,217
Zambia,Immigrants,Foreigners,903,Africa,910,Eastern Africa,902,Developing regions,11,17,11,7,16,9,15,23,44,68,77,69,73,46,51,41,34,72,34,51,39,78,50,46,56,91,77,71,64,60,102,69,46,59
Zimbabwe,Immigrants,Foreigners,903,Africa,910,Eastern Africa,902,Developing regions,72,114,102,44,32,29,43,68,99,187,129,94,61,72,78,58,39,44,43,49,98,110,191,669,1450,615,454,663,611,508,494,434,437,407

In [280]:
canada['AREA'].head(5).sum(axis=0)

4563